# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MullionTypeSet..::..Erase Method
MullionTypeSet Class See Also
---
Removes a specified mullion type from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	MullionType item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As MullionType _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	MullionType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..MullionTypeThe mullion type to be erased.
# ### Return Value
The number of mullion types that were erased from the set.
# See Also
MullionTypeSet Class
Autodesk.Revit.DB Namespace